IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM15_CONTROLSS_G0_EPWM15.xml
	<register id="CONTROLSS_G0_EPWM15_DCCAPCTL" acronym="CONTROLSS_G0_EPWM15_DCCAPCTL" offset="0x190" width="16" description="Digital Compare Capture Control Register">
		<bitfield id="CAPMODE" width="1" begin="15" end="15" resetval="0x0" description="Counter Capture Mode   0: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs, further trip [capture] events are ignored until the next PRD_eq or CNT_zero event [as selected by the PULSESEL bit in the DCFCTL register] re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value.   1: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs - it will set the CAPSTS flag and further trip [capture] events are ignored until this bit is cleared. CAPSTS can be cleared by writing to CAPCLR bit in DCCAPCTL register and it re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value." range="15" rwaccess="R/W"/> 
		<bitfield id="CAPCLR" width="1" begin="14" end="14" resetval="0x0" description="DC Capture Latched Status Clear Flag   0: Writing a 0 has no effect.  1: Writing a 1 will clear this CAPSTS [set] condition." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CAPSTS" width="1" begin="13" end="13" resetval="0x0" description="Latched Status Flag for Capture Event   0: No DC capture event occurred.  1: A DC capture event has occurred." range="13" rwaccess="R"/> 
		<bitfield id="SHDWMODE" width="1" begin="1" end="1" resetval="0x0" description="TBCTR Counter Capture Shadow Select Mode   0: Enable shadow mode. The DCCAP active register is copied to shadow register on a TBCTR = TBPRD or TBCTR = zero event as defined by the DCFCTL[PULSESEL] bit. CPU reads of the DCCAP register will return the shadow register contents.  1: Active Mode. In this mode the shadow register is disabled. CPU reads from the DCCAP register will always return the active register contents." range="1" rwaccess="R/W"/> 
		<bitfield id="CAPE" width="1" begin="0" end="0" resetval="0x0" description="TBCTR Counter Capture Enable/Disable   0: Disable the time-base counter capture.  1: Enable the time-base counter capture." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCFOFFSET" acronym="CONTROLSS_G0_EPWM15_DCFOFFSET" offset="0x192" width="16" description="Digital Compare Filter Offset Register ">
		<bitfield id="DCFOFFSET" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Offset  These 16-bits specify the number of TBCLK cycles from the blanking window reference to the point when the blanking window is applied. The blanking window reference is either period or zero as defined by the DCFCTL[PULSESEL] bit. This offset register is shadowed and the active register is loaded at the reference point defined by DCFCTL[PULSESEL]. The offset counter is also initialized and begins to count down when the active register is loaded. When the counter expires, the blanking window is applied. If the blanking window is currently active, then the blanking window counter is restarted." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCFOFFSETCNT" acronym="CONTROLSS_G0_EPWM15_DCFOFFSETCNT" offset="0x194" width="16" description="Digital Compare Filter Offset Counter Register">
		<bitfield id="DCFOFFSETCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Offset Counter  These 16-bits are read only and indicate the current value of the offset counter. The counter counts down to zero and then stops until it is re-loaded on the next period or zero event as defined by the DCFCTL[PULSESEL] bit. The offset counter is not affected by the free/soft emulation bits. That is, it will always continue to count down if the device is halted by a emulation stop." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCFWINDOW" acronym="CONTROLSS_G0_EPWM15_DCFWINDOW" offset="0x196" width="16" description="Digital Compare Filter Window Register">
		<bitfield id="DCFWINDOW" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Width   00h: No blanking window is generated.  01-FFFFh: Specifies the width of the blanking window in TBCLK cycles. The blanking window begins when the offset counter expires. When this occurs, the window counter is loaded and begins to count down. If the blanking window is currently active and the offset counter expires, the blanking window counter is not restarted and the blanking window is cut short prematurely. Care should be taken to avoid this situation. The blanking window can cross a PWM period boundary." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCFWINDOWCNT" acronym="CONTROLSS_G0_EPWM15_DCFWINDOWCNT" offset="0x198" width="16" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Counter  These 16 bits are read only and indicate the current value of the window counter. The counter counts down to zero and then stops until it is re-loaded when the offset counter reaches zero again." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_BLANKPULSEMIXSEL" acronym="CONTROLSS_G0_EPWM15_BLANKPULSEMIXSEL" offset="0x19A" width="16" description="Blanking window trigger pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [BLANKPULSEMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [BLANKPULSEMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [BLANKPULSEMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCCAPMIXSEL" acronym="CONTROLSS_G0_EPWM15_DCCAPMIXSEL" offset="0x19C" width="16" description="Capture Event pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [DCCAPMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [DCCAPMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [DCCAPMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM15_DCCAP" acronym="CONTROLSS_G0_EPWM15_DCCAP" offset="0x19E" width="16" description="Digital Compare Counter Capture Register ">
		<bitfield id="DCCAP" width="16" begin="15" end="0" resetval="0x0" description="Digital Compare Time-Base Counter Capture  To enable time-base counter capture, set the DCCAPCLT[CAPE] bit to 1. If enabled, reflects the value of the time-base counter [TBCTR] on the low to high edge transition of a filtered [DCEVTFLT] event. Further capture events are ignored until the next period or zero as selected by the DCFCTL[PULSESEL] bit. Shadowing of DCCAP is enabled and disabled by the DCCAPCTL[SHDWMODE] bit. By default this register is shadowed. - If DCCAPCTL[SHDWMODE] = 0, then the shadow is enabled. In this mode, the active register is copied to the shadow register on the TBCTR = TBPRD or TBCTR = zero as defined by the DCFCTL[PULSESEL] bit. CPU reads of this register will return the shadow register value. - If DCCAPCTL[SHDWMODE] = 1, then the shadow register is disabled. In this mode, CPU reads will return the active register value. The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R"/>
	</register>
